# Тема 17

### Пример решения задания

Файл содержит последовательность неотрицательных целых чисел, не превышающих 10 000.
Назовём парой два идущих подряд элемента последовательности.\
Определите количество таких пар, в которых запись ровно одного элемента заканчивается цифрой 6,
а сумма квадратов элементов пары меньше, чем квадрат наименьшего из элементов последовательности,
запись которых заканчивается цифрой 6.\
В ответе запишите два числа: сначала количество найденных пар,
затем максимальную сумму квадратов элементов этих пар.

Фрагмент файла `17.1.txt`:
```
5196
-2074
-1943
3612
4303
-9995
2257
9386
-7653
-235
436
9738
983
```

```python
nums = list(map(int, open('17.1.txt').readlines()))

min_num = 0
for num in nums:
    if abs(num) % 10 == 6:
        min_num = min(min_num, num)
# Альтернативный (короткий) вариант
# print(min(nums, key=lambda x: x if abs(x) % 10 == 6 else 0))
'''
xor (исключающее ИЛИ)
a b f
0 0 0
0 1 1
1 0 1
1 1 0
В python заменяется на !=
Вместо:
(abs(nums[i]) % 10 == 6 and abs(nums[i + 1]) % 10 != 6) or (abs(nums[i]) % 10 != 6 and abs(nums[i + 1]) % 10 == 6)
Пишем:
((abs(nums[i]) % 10 == 6) != (abs(nums[i + 1]) % 10 == 6))
'''
count = 0
m = 0
for i in range(len(nums) - 1):
    if ((abs(nums[i]) % 10 == 6) != (abs(nums[i + 1]) % 10 == 6)) and (nums[i] ** 2 + nums[i + 1] ** 2 < min_num ** 2):
        count += 1
        m = max(m, nums[i] ** 2 + nums[i + 1] ** 2)
print(count, m)
```

Ответ: 720 99266105

### Пример решения задания (II вариант)

В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает 10 000.
Определите и запишите в ответе сначала количество пар элементов последовательности,
для которых произведение элементов делится без остатка на 10, затем максимальную из сумм элементов таких пар.
В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

Фрагмент файла `17.2.txt`:
```
5500
6971
3572
7600
2822
5687
9741
8623
7954
1029
9913
380
7965
3679
2626
3699
7972
```

```python
f = open('17.2.txt')
nums = list(map(int, f.readlines()))
count = 0
max = -20001
for i in range(len(nums)):
    for j in range(i + 1, len(nums)):
        if (nums[i] * nums[j]) % 10 == 0:
            count += 1
            if (nums[i] + nums[j]) > max:
                max = (nums[i] + nums[j])

print(count, max)
```

Ответ: 13510315 19999