
#### Примеры заданий

###### Пример 1

> Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих 
> командах v и w обозначают цепочки цифр.  
> А) **заменить** (v, w)  
> Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды
> **заменить** (111, 27) преобразует строку 05111150 в строку 0527150.  
> Если в строке нет вхождений цепочки v, то выполнение команды **заменить** (v, w) не меняет эту строку.  
> Б) **нашлось** (v)  
> Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда 
> возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка исполнителя при 
> этом не изменяется.  
> 
> Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 125 идущих подряд цифр 8?
> В ответе запишите полученную строку.
>
> ```
> НАЧАЛО  
> ПОКА нашлось (333) ИЛИ нашлось (888)  
>    ЕСЛИ нашлось (333)  
>        ТО заменить (333, 8)  
>        ИНАЧЕ заменить (888, 3)  
>    КОНЕЦ ЕСЛИ  
> КОНЕЦ ПОКА  
> КОНЕЦ


```python
s = '8' * 125
while '333' in s or '888' in s:
    if '333' in s:
        s = s.replace('333', '8', 1)
    else:
        s = s.replace('888', '3', 1)
print(s)
```

> Ответ: 388


## Методы сокращения permutations с повторяющимися элементами

```python
from itertools import permutations
permutations = list(set(permutations(['a', 'b', 'c', 'a', 'a', 'a', 'a'])))
```