## Задание 5

Используемые темы: срезы, строки, системы счисления.

> <code>bin(число)</code>
> Функция, переводит число из десятичной системы счисления в двоичную.
> Возвращает строку в формате <code>0bXXXXX</code>, которое является двоичным представлением числа.
> Поэтому для использования этой функции в вычислениях необходимо
> избавлять от первых двух символов при помощи срезов: <code>bin(число)[2:]</code>

> <code>int(строка, система_счисления)</code>
> Функция, переводит число, представленное в виде строки из какой-либо системы счисления в десятичную.
> Максимальная сс, которую может обработать функция - 36.
> Символы строки должны соответствовать символам данной сс.


### Пример решения простого задания

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:\
а) если сумма цифр в двоичной записи числа чётная, то к этой записи слева дописывается 10, а затем два правых разряда заменяются на 00;\
б) если сумма цифр в двоичной записи числа нечётная, то к этой записи слева дописывается 11, а затем два правых разряда заменяются на 11.\

Полученная таким образом запись является двоичной записью искомого числа R.
Укажите максимальное число R, которое может быть получено при обработке числа N, меньшего 30. В ответе запишите это число в десятичной системе счисления.

Ответ: 127

```python
maxr = 0
# Решаем методом подбора
for n in range(4, 29):
    # bin(<число>) - функция, переводящая число в двоичную систему (в виде 0b0100101)
    # [2:] - срез, убирающий ненужные 2 символа в начале строки
    binary = bin(n)[2:]
    if binary.count('1') % 2 == 0:
        binary = "10" + binary[:-2] + "00"
    else:
        binary = "11" + binary[:-2] + "11"
    # int(<строка>, <система ИЗ которой переводим>) - переводит строку из любой системы в десятичную
    R = int(binary, 2)
    maxr = max(maxr, R)
print(maxr)
```